tap "anomalyco/tap"
tap "chaychoong/tap"
tap "sikarugir-app/sikarugir"
tap "xanaxxxxxx/tap"
brew "btop"
brew "cargo-binstall"
brew "chezmoi"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "go"
brew "golang-migrate"
brew "hey"
brew "imagemagick"
brew "jj"
brew "jjui"
brew "jq"
brew "lazygit"
brew "lsd"
brew "lua-language-server"
brew "make"
brew "marksman"
brew "mkcert"
brew "mole"
brew "tree-sitter"
brew "neovim", args: ["HEAD"]
brew "nss"
brew "oxfmt"
brew "oxlint"
brew "p7zip"
brew "pinentry-mac"
brew "poppler"
brew "resvg"
brew "ripgrep"
brew "sevenzip"
brew "tree-sitter-cli"
brew "yaml-language-server"
brew "yazi"
brew "zoxide"
brew "anomalyco/tap/opencode"
cask "beekeeper-studio"
cask "font-maple-mono"
cask "font-maple-mono-nf"
cask "chaychoong/tap/font-opus-one"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "obsidian"
cask "orbstack"
cask "rar"
cask "raycast"
cask "sequel-ace"
cask "sikarugir-app/sikarugir/sikarugir"
cask "vlc"
go "github.com/air-verse/air"
go "golang.org/x/tools/cmd/callgraph"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/mattn/efm-langserver"
go "github.com/davidrjenni/reftools/cmd/fillswitch"
go "github.com/aarzilli/gdlv"
go "github.com/onsi/ginkgo/v2/ginkgo"
go "github.com/abice/go-enum"
go "mvdan.cc/gofumpt"
go "golang.org/x/tools/cmd/goimports"
go "github.com/twpayne/go-jsonstruct/v3/cmd/gojsonstruct"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "github.com/nametake/golangci-lint-langserver"
go "github.com/segmentio/golines"
go "github.com/fatih/gomodifytags"
go "github.com/abenz1267/gomvp"
go "golang.org/x/tools/cmd/gonew"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "gotest.tools/gotestsum"
go "golang.org/x/vuln/cmd/govulncheck"
go "github.com/rakyll/hey"
go "github.com/koron/iferr"
go "github.com/josharian/impl"
go "github.com/tmc/json-to-struct"
go "go.uber.org/mock/mockgen"
go "github.com/kyoh86/richgo"
go "github.com/sqls-server/sqls"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/a-h/templ/cmd/templ"
cargo "helix-term"
cargo "lazyjj"
cargo "rustlings"
cargo "taplo-cli"
cargo "workshop-runner"
npm "@tailwindcss/language-server"
npm "corepack"
